app/controllers/admin/categories_controller.rb

    def update
      @category = Category.find(params[:id])

      if @category.update_attributes(permitted_params)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 6)
UPDATE "categories" SET "updated_at" = '2010-10-08 18:07:21', "base_colour" = '#00bfab' WHERE "id" = 6

    def create
      @category = Category.new(permitted_params)

      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "description", "photo_id", "base_colour", "sort") VALUES('Abstract', '2010-10-08 18:06:55', '2010-10-08 18:06:55', '', NULL, '#00bf7e', NULL)