app/controllers/admin/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY photos.id ASC LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "photos"
---
  def index
    @photos = Photo.paginate(:page => params[:page])

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def edit
    @photo = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 3)
UPDATE "photos" SET "updated_at" = '2010-10-08 18:04:19', "title" = 'Cross', "flickr_url" = '', "description" = 'How can men feel themselves honoured by the humiliation of their fellow beings?' WHERE "id" = 3
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

INSERT INTO "photos" ("photo_file_size", "created_at", "title", "flickr_url", "photo_file_name", "updated_at", "photo_content_type", "photo_updated_at", "description", "sort") VALUES(321666, '2010-10-08 18:03:46', 'Emerald Panarama', '', 'Emerald Panarama.jpg', '2010-10-08 18:03:46', 'image/jpeg', '2010-10-08 18:03:42', '', NULL)
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT * FROM "photos" WHERE ("photos"."id" = 9)
DELETE FROM "photos" WHERE "id" = 9
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy