app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate :all, :page => params[:page], :per_page => 4

    @num_categories = @categories.count

    @photos = Photo.all(:limit => 2, :order => 'RANDOM()', :conditions => { :featured => true })
---
SELECT * FROM "categories" LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "categories"
SELECT * FROM "photos" WHERE ("photos".category_id = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "description", "photo_id") VALUES('Landscapes', '2010-10-08 10:29:53', '2010-10-08 10:29:53', '', NULL)

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 4)
UPDATE "categories" SET "updated_at" = '2010-10-08 10:57:50', "base_colour" = '#99bf00' WHERE "id" = 1