app/controllers/pages_controller.rb

SELECT * FROM "photos" ORDER BY RANDOM() LIMIT 1
---
  def index
    @photo = Photo.featured.order('RANDOM()').first