app/controllers/photos_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = '--- :category_id
SELECT * FROM "photos" INNER JOIN "categories_photos" ON "photos".id = "categories_photos".photo_id WHERE ("categories_photos".category_id = 1 ) LIMIT 11 OFFSET 0
SELECT count(*) AS count_all FROM "photos" INNER JOIN "categories_photos" ON "photos".id = "categories_photos".photo_id WHERE ("categories_photos".category_id = 3 )
---
    def index
        if params[:category_id]
            @category = Category.find_by_id(params[:category_id])
            @photos = @category.photos.paginate :page => params[:page], :per_page => 11

INSERT INTO "photos" ("photo_file_size", "created_at", "title", "flickr_url", "photo_file_name", "updated_at", "photo_content_type", "photo_updated_at", "description", "sort") VALUES(212862, '2010-10-08 18:01:00', NULL, NULL, 'Cross.jpg', '2010-10-08 18:01:00', 'image/jpeg', '2010-10-08 18:00:58', 'The Famine Memorial at Lough Doolough.
---
    def create
        @photo = Photo.new(params[:photo])
        if @photo.save

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
    def show
        @photo = Photo.find(params[:id])